Revit 2026 API

# IFCParameterTemplateExportToFile Method

---

Export mapping template to a text file.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void ExportToFile(
	string fileName
)
```
```vb
Public Sub ExportToFile (
	fileName As String
)
```
```cpp
public:
void ExportToFile(
	String^ fileName
)
```
```fsharp
member ExportToFile :
        fileName : string -> unit
```

#### Parameters

fileName String
     The full text file name.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |
| FileAccessException | Failed to access the text file. |

#### Reference

IFCParameterTemplate Class

Autodesk.Revit.DB Namespace